# # -*- mode: org -*- coding: utf-8 -*-
#+TITLE: 
#+AUTHOR:
#+EMAIL: 
#+DATE: 
#+LANGUAGE:  en
# #+INFOJS_OPT: view:showall ltoc:t mouse:underline
#+HTML_HEAD: <link rel="stylesheet" href="./tufte.css" type="text/css">
#+HTML_HEAD: <link rel="stylesheet" href="./ox-tufte.css" type="text/css">
#+HTML_HEAD_EXTRA: <style>
#+HTML_HEAD_EXTRA: article > div.org-src-container {
#+HTML_HEAD_EXTRA:     width: var(--ox-tufte-content-width);
#+HTML_HEAD_EXTRA:     max-width: var(--ox-tufte-content-width);
#+HTML_HEAD_EXTRA:     clear: none;
#+HTML_HEAD_EXTRA: }
#+HTML_HEAD_EXTRA: article > section .org-src-container {
#+HTML_HEAD_EXTRA:     width: var(--ox-tufte-src-code-width);
#+HTML_HEAD_EXTRA:     max-width: var(--ox-tufte-src-code-width);
#+HTML_HEAD_EXTRA:     clear: none;
#+HTML_HEAD_EXTRA: }
#+HTML_HEAD_EXTRA: div.org-src-container > pre { clear: none; }
#+HTML_HEAD_EXTRA: pre.example {clear: none; }
#+HTML_HEAD_EXTRA: </style>
#+INCLUDE: "./header.org" :minlevel 1
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_FILE_NAME: ArtificialIntelligence1.html
#+OPTIONS: H:15 num:nil toc:nil \n:nil @:t ::t |:t _:{} *:t ^:{} prop:nil
#+OPTIONS: tex:t
#+OPTIONS: html-postamble:nil
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [american]
# Setup tikz package for both LaTeX and HTML export:
# #+LATEX_HEADER: \usepackqqqage{tikz}
# #+LATEX_HEADER: \usepackage{commath}
# #+LaTeX_HEADER: \usepackage{pgfplots}
# #+LaTeX_HEADER: \usepackage{sansmath}
# #+LaTeX_HEADER: \usepackage{mathtools}
# #+PROPERTY: header-args:latex+ :packages '(("" "tikz"))
#
#+PROPERTY: header-args:latex+ :exports results :fit yes
#
#+STARTUP: showall
#+STARTUP: align
#+STARTUP: indent
#+STARTUP: shrink
# This makes MathJax/LaTeX appear in buffer (UTF-8)
#+STARTUP: latexpreview
#+STARTUP: entitiespretty
# #+STARTUP: logdrawer
# This makes pictures appear in buffer
#+STARTUP: inlineimages
#+STARTUP: fnadjust
# #+OPTIONS: html-style:nil
#+html_head_extra: <style> .title { display: none; } </style>
#+html_head_extra: <style> caption.t-bottom { caption-side: bottom; } </style>

* Lisp Lore and Logic

#+begin_src lisp :session *colisp* :results verbatim :exports both
(car (list 1 2 3))
#+end_src

#+RESULTS:
: 1 (1 bit, #x1, #o1, #b1)

Logical implication $A \implies B$ can be defined as $\lnot A \lor B$
simply because their truth tables are identical. There is no actual
/implies/ operator; hence, we make one out of $\lnot$ and $\lor$

#+begin_src lisp :results verbatim :exports both
(defun implies (ant cqnt)
  (or (not ant) cqnt))
#+end_src

#+RESULTS:
: IMPLIES

Test

#+begin_src lisp :results verbatim :exports both
(or (implies nil t) (implies t nil))
#+end_src

#+RESULTS:
: T

/If and only if/ ($\iff$) would be

#+begin_src lisp :results verbatim :exports both
(defun if&oif (r s)
  (and (implies r s) (implies s r)))
#+end_src

#+RESULTS:
: IF&OIF





#+INCLUDE: "./footer.org" :minlevel 1

* Footnotes


